src/cf/Catalogs/Notes.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.12">
	<Catalog>
		<Properties>
			<Name>Notes</Name>
			<Hierarchical>true</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Author</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Users</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Topic</Name>
					<Type>
						<v8:TypeSet>cfg:ExchangePlanRef</v8:TypeSet>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCalculationTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfAccountsRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Content</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ContentText</Name>
					<Comment>An attribute for full-text search</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ForDesktop</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Check</Name>
					<Type>
						<v8:Type>cfg:EnumRef.NoteColors</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ChangeDate</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>SubjectPresentation</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/cf/CommonModules/UserNotesInternal/Ext/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2019, 1C-Soft LLC
// All Rights reserved. This application and supporting materials are provided under the terms of 
// Attribution 4.0 International license (CC BY 4.0)
// The license text is available at:
// https://creativecommons.org/licenses/by/4.0/legalcode
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Region Internal

////////////////////////////////////////////////////////////////////////////////
// Configuration subsystems event handlers.

// See BatchObjectModificationOverridable.OnDetermineObjectsWithEditableAttributes. 
Procedure OnDefineObjectsWithEditableAttributes(Objects) Export
	Objects.Insert(Metadata.Catalogs.Notes.FullName(), "AttributesToEditInBatchProcessing");
EndProcedure

// See CommonOverridable.OnAddMetadataObjectsRenaming. 
Procedure OnAddMetadataObjectsRenaming(Total) Export
	
	Library = "StandardSubsystems";
	
	OldName = "Role.NotesUsage";
	NewName  = "Role.AddEditNotes";
	Common.AddRenaming(Total, "2.3.3.11", OldName, NewName, Library);
	
EndProcedure

// See ToDoListOverridable.OnDetermineToDoListHandlers 
Procedure OnFillToDoList(ToDoList) Export
	
	ModuleToDoListServer = Common.CommonModule("ToDoListServer");
	If Not AccessRight("Edit", Metadata.Catalogs.Notes)
		Or Not GetFunctionalOption("UseNotes")
		Or ModuleToDoListServer.UserTaskDisabled("UserNotes") Then
		Return;
	EndIf;
	
	// This procedure is only called when To-do list subsystem is available. Therefore, the subsystem 
	// availability check is redundant.
	Sections = ModuleToDoListServer.SectionsForObject(Metadata.Catalogs.Notes.FullName());
	
	NumberOfNotes = NumberOfNotes();
	
	For Each Section In Sections Do
		NoteID = "UserNotes" + StrReplace(Section.FullName(), ".", "");
		ToDoItem = ToDoList.Add();
		ToDoItem.ID = NoteID;
		ToDoItem.HasToDoItems      = NumberOfNotes > 0;
		ToDoItem.Presentation = NStr("ru = 'Мои заметки'; en = 'My notes'; pl = 'My notes';de = 'My notes';ro = 'My notes';tr = 'My notes'; es_ES = 'My notes'");
		ToDoItem.Count    = NumberOfNotes;
		ToDoItem.Form         = "Catalog.Notes.Form.AllNotes";
		ToDoItem.Owner      = Section;
	EndDo;
	
EndProcedure

// See UserRemindersOverridable.OnFillSourceAttributesListWithReminderDates. 
Procedure OnFillSourceAttributesListWithReminderDates(Source, AttributesArray) Export
	
	If TypeOf(Source) = Type("CatalogRef.Notes") Then
		AttributesArray.Clear();
	EndIf;
	
EndProcedure

// See AccessManagementOverridable.OnFillListsWithAccessRestriction. 
Procedure OnFillListsWithAccessRestriction(Lists) Export
	
	Lists.Insert(Metadata.Catalogs.Notes, True);
	
EndProcedure

#EndRegion

#Region Private

Procedure SetClearNotesDeletionMark(Source, Cancel) Export
	
	If Source.DataExchange.Load Then
		Return;
	EndIf;
	
	DeletionMark = Source.DeletionMark;
	If Not DeletionMark AND Not Source.AdditionalProperties.Property("DeletionMarkCleared") Then
		Return;
	EndIf;
	
	QueryText =
	"SELECT
	|	Notes.Ref AS Ref
	|FROM
	|	Catalog.Notes AS Notes
	|WHERE
	|	Notes.DeletionMark = &DeletionMark
	|	AND &OwnerField = &Owner";
	
	OwnerField = "Notes.Topic";
	If TypeOf(Source) = Type("CatalogObject.Users") 
		AND (DeletionMark Or Source.AdditionalProperties.Property("DeletionMarkCleared")) Then
			OwnerField = "Notes.Author";
	EndIf;
	
	QueryText = StrReplace(QueryText, "&OwnerField", OwnerField);
	
	Query = New Query(QueryText);
	Query.SetParameter("Owner", Source.Ref);
	Query.SetParameter("DeletionMark", Not DeletionMark);
	
	SetPrivilegedMode(True);
	
	Selection = Query.Execute().Select();
	While Selection.Next() Do
		NoteObject = Selection.Ref.GetObject();
		NoteObject.SetDeletionMark(DeletionMark, False);
		NoteObject.AdditionalProperties.Insert("NoteDeletionMark", True);
		Try
			NoteObject.Write();
		Except
			ErrorText = DetailErrorDescription(ErrorInfo());
			WriteLogEvent(NStr("ru = 'Заметки пользователя.Изменение пометки удаления'; en = 'User notes.Change deletion mark'; pl = 'User notes.Change deletion mark';de = 'User notes.Change deletion mark';ro = 'User notes.Change deletion mark';tr = 'User notes.Change deletion mark'; es_ES = 'User notes.Change deletion mark'", Common.DefaultLanguageCode()),
				EventLogLevel.Error, NoteObject.Metadata(), NoteObject.Ref, ErrorText);
		EndTry;
	EndDo;
	
EndProcedure

// Adds a flag of changing object deletion mark.
Procedure SetDeletionMarkChangeStatus(Source) Export
	
	If Source.DataExchange.Load Then
		Return;
	EndIf;
	
	If Not Source.DeletionMark Then
		DeletionMarkByRef = Common.ObjectAttributeValue(Source.Ref, "DeletionMark");
		If DeletionMarkByRef = True Then
			Source.AdditionalProperties.Insert("DeletionMarkCleared");
		EndIf;
	EndIf;
	
EndProcedure

Function NumberOfNotes()
	
	Query = New Query;
	Query.Text =
	"SELECT
	|	COUNT(CatalogNotes.Ref) AS Count
	|FROM
	|	Catalog.Notes AS CatalogNotes
	|WHERE
	|	CatalogNotes.Author = &User
	|		AND NOT CatalogNotes.DeletionMark";
	
	Query.SetParameter("User", Users.CurrentUser());
	
	QueryResult = Query.Execute().Unload();
	Return QueryResult[0].Count;
	
EndFunction

#EndRegion
